Repository: myTNB-SONAR/myTNB-Xamarin-android-3.2.7-sit
Catalog: myTNB.iOS/Resources/*.lproj/Localizable.strings
Languages: ms

# Manage_RemoveCardTitle
source: Remove Credit / Debit Card
ms: MS-Remove Credit / Debit Card

# Manage_VerifyMobileNumber
source: For security purpose, please enter your mobile number to verify this device.
ms: MS-For security purpose, please enter your mobile number to verify this device.

# Manage_MobileNumberNotVerifiedTitle
source: Verify Device
ms: MS-Verify Device

# Manage_MobileNumberVerifiedTitle
source: Update Mobile No.
ms: MS-Update Mobile No.

# Manage_PasswordTitle
source: Update Password
ms: MS-Update Password

# More_AppVersion
source: App Version
ms: MS-App Version

# More_CallUsBilling
source: Call Us (Billing Enquiries)
ms: MS-Call Us (Billing Enquiries)

# More_CallUsOutagesAndBreakdown
source: Call Us (Outages & Breakdown)
ms: MS-Call Us (Outages & Breakdown)

# More_FAQ
source: FAQ
ms: MS-FAQ

# More_FindUs
source: Find Us
ms: MS-Find Us

# More_HelpAndSupport
source: Help & Support
ms: MS-Help & Support

# More_MyAccount
source: My Account
ms: MS-My Account

# More_Notifications
source: Notifications
ms: MS-Notifications

# More_RateThisApp
source: Rate this app
ms: MS-Rate this app

# More_Settings
source: Settings
ms: MS-Settings

# More_Share
source: Share
ms: MS-Share

# More_ShareMessage
source: New myTNB app is now available in App Store.
ms: MS-New myTNB app is now available in App Store.

# More_ShareThisApp
source: Share this app
ms: MS-Share this app

# More_Title
source: More
ms: MS-More

# More_TnC
source: Terms & Conditions
ms: MS-Terms & Conditions

# MyAccount_AddAccountDetails
source: Add your existing TNB Electricity Supply Account to view usage and transaction details.
ms: MS-Add your existing TNB Electricity Supply Account to view usage and transaction details.

# MyAccount_Logout
source: Logout
ms: MS-Logout

# MyAccount_LogoutConfirmation
source: Are you sure you want to log out from myTNB app?
ms: MS-Are you sure you want to log out from myTNB app?

# MyAccount_MyTNBAccount
source: myTNB Account
ms: MS-myTNB Account

# MyAccount_Title
source: My Account
ms: MS-My Account

# MyAccount_TNBSupplyAccount
source: TNB Electricity Supply Account
ms: MS-TNB Electricity Supply Account

# MyAccount_UpdatedMobileNumber
source: Your mobile number has been updated successfully.
ms: MS-Your mobile number has been updated successfully.

# MyAccount_UpdatedPassword
source: Your password has been updated successfully.
ms: MS-Your password has been updated successfully.

# MyAccount_UpdatedTNBAccount
source: Your electricity supply account has been removed from myTNB account.
ms: MS-Your electricity supply account has been removed from myTNB account.

# Notification_Channel
source: Select how you wish to receive your notifications
ms: MS-Select how you wish to receive your notifications

# Notification_Title
source: Notifications Settings
ms: MS-Notifications Settings

# Notification_Type
source: Select the type of notifications you wish to receive from TNB
ms: MS-Select the type of notifications you wish to receive from TNB

# Onboarding_BillingMessage
source: Contribute to a greener environment by viewing your e-bill on the app
ms: MS-Contribute to a greener environment by viewing your e-bill on the app

# Onboarding_BillingTitle
source: View your bill
ms: MS-View your bill

# Onboarding_NewUpdateTitle
source: New Update Available
ms: MS-New Update Available

# Onboarding_PaymentMessage
source: Make your payments at home or on-to-go. No more late charges!
ms: MS-Make your payments at home or on-to-go. No more late charges!

# Onboarding_PaymentTitle
source: Pay your bills
ms: MS-Pay your bills

# Onboarding_Skip
source: Skip
ms: MS-Skip

# Onboarding_UpdateNow
source: Update Now
ms: MS-Update Now

# Onboarding_UsageMessage
source: Find all the information you need about your usage in a single screen
ms: MS-Find all the information you need about your usage in a single screen

# Onboarding_UsageTitle
source: Track your usage
ms: MS-Track your usage

# Payment_AbortTitle
source: Abort Payment!
ms: MS-Abort Payment!

# Payment_AbortMessage
source: Are you sure you want to abort payment?
ms: MS-Are you sure you want to abort payment?

# Payment_AcceptedCards
source: Only credit / debit cards issued in Malaysia are accepted.
ms: MS-Only credit / debit cards issued in Malaysia are accepted.

# Payment_AddCard
source: Add Card
ms: MS-Add Card

# Payment_AlreadySavedCardMessage
source: Seems like you are paying with an already saved Credit / Debit Card. Do you want to continue?
ms: MS-Seems like you are paying with an already saved Credit / Debit Card. Do you want to continue?

# Payment_CVVFourDigitMessage
source: Please enter the 4-digit CVV/CVC located at the front of your credit card.
ms: MS-Please enter the 4-digit CVV/CVC located at the front of your credit card.

# Payment_CVVThreeDigitMessage
source: Please enter the 3-digit CVV/CVC located at the back of your credit card.
ms: MS-Please enter the 3-digit CVV/CVC located at the back of your credit card.

# Payment_EnterOTP
source: Enter OTP
ms: MS-Enter OTP

# Payment_LoadMore
source: Load More
ms: MS-Load More

# Payment_MaxCCAmount
source: For payments more than RM 5000, please use FPX payment mode.
ms: MS-For payments more than RM 5000, please use FPX payment mode.

# Payment_Multiple
source: Pay Bill ({0})
ms: MS-Pay Bill ({0})

# Payment_OnlineBanking
source: Online Banking
ms: MS-Online Banking

# Payment_OnlineBankingViaFPX
source: Online Banking via FPX
ms: MS-Online Banking via FPX

# Payment_OtherMethods
source: Other Payment Methods
ms: MS-Other Payment Methods

# Payment_SaveCardMessage
source: I want to save this card for future use.
ms: MS-I want to save this card for future use.

# Payment_ScanMessage
source: Scan the front of your credit / debit card to retrieve card details.
ms: MS-Scan the front of your credit / debit card to retrieve card details.

# Payment_SelectMethodTitle
source: Select Payment Method
ms: MS-Select Payment Method

# Payment_Single
source: Pay Bill
ms: MS-Pay Bill

# Payment_ValidCard
source: Valid card number
ms: MS-Valid card number

# Promotion_NoPromotion
source: No promotions currently. Check back later!
ms: MS-No promotions currently. Check back later!

# Promotion_Title
source: Promotions
ms: MS-Promotions

# PushNotification_AllNotifications
source: All Notifications
ms: MS-All Notifications

# PushNotification_DeleteMessage
source: Are you sure you want to delete this notification?
ms: MS-Are you sure you want to delete this notification?

# PushNotification_DeleteTitle
source: Delete Notification
ms: MS-Delete Notification

# PushNotification_NoNotification
source: No notifications yet.
ms: MS-No notifications yet.

# PushNotification_NotificationRemoved
source: Notification removed.
ms: MS-Notification removed.

# PushNotification_SelectNotification
source: Select Notification
ms: MS-Select Notification

# PushNotification_Title
source: Notifications
ms: MS-Notifications

# PushNotification_ViewDetails
source: View Details
ms: MS-View Details

# PushNotification_ViewPromotion
source: View Promotion
ms: MS-View Promotion

# Rating_CharacterLeft
source: character left
ms: MS-character left

# Rating_CharactersLeft
source: characters left
ms: MS-characters left

# Rating_Comments
source: Comments
ms: MS-Comments

# Rating_Description
source: Your rating will help us serve you better.
ms: MS-Your rating will help us serve you better.

# Rating_ThankYou
source: Thank you.
ms: MS-Thank you.

# Rating_Title
source: Rating
ms: MS-Rating

# Receipt_AccountName
source: Account Holder's Name
ms: MS-Account Holder's Name

# Receipt_Filename
source: Receipt-{0}.pdf
ms: MS-Receipt-{0}.pdf

# Receipt_MessageFull
source: Thank you for using myTNB. We are pleased to inform you that the following online payment via {0} is Successful:
ms: MS-Thank you for using myTNB. We are pleased to inform you that the following online payment via {0} is Successful:

# Receipt_MessagePartOne
source: Thank you for using myTNB.
ms: MS-Thank you for using myTNB.

# Receipt_MessagePartTwo
source: We are pleased to inform you that the following online payment via {0} is Successful:
ms: MS-We are pleased to inform you that the following online payment via {0} is Successful:

# Receipt_NoReceipt
source: No Receipt Found
ms: MS-No Receipt Found

# Receipt_Note
source: NOTE: This receipt is computer generated and no signature is required.
ms: MS-NOTE: This receipt is computer generated and no signature is required.

# Receipt_ReferenceNumber
source: Reference Number
ms: MS-Reference Number

# Receipt_Salutation
source: Dear Customer,
ms: MS-Dear Customer,

# Receipt_Title
source: Payment Receipt
ms: MS-Payment Receipt

# Receipt_TrnDate
source: TRANSACTION DATE
ms: MS-TRANSACTION DATE

# Receipt_TrnId
source: TRANSACTION ID
ms: MS-TRANSACTION ID

# Receipt_TrnMethod
source: TRANSACTION METHOD
ms: MS-TRANSACTION METHOD

# Registration_AccountNumberLocation
source: Your 12-digit account no. can be found on the top left corner of your monthly paper bill.
ms: MS-Your 12-digit account no. can be found on the top left corner of your monthly paper bill.

# Registration_AddAccountSuccessMessage
source: Add Account(s) Successful
ms: MS-Add Account(s) Successful

# Registration_AddingAccountMessage
source: This may take a while as we are adding your TNB account.
ms: MS-This may take a while as we are adding your TNB account.

# Registration_AddingAccountsMessage
source: This may take a while as we are adding your TNB accounts.
ms: MS-This may take a while as we are adding your TNB accounts.

# Registration_AddingAccountTitle
source: Adding {0} Account
ms: MS-Adding {0} Account

# Registration_AddingAccountsTitle
source: Adding {0} Accounts
ms: MS-Adding {0} Accounts

# Registration_AdditionalAccounts
source: Additional account(s)
ms: MS-Additional account(s)

# Registration_AnswerForNonOwner
source: I’m renting this place / it belongs to my parents.
ms: MS-I’m renting this place / it belongs to my parents.

# Registration_AnswerForOwner
source: I'm the owner of this electricity supply account.
ms: MS-I'm the owner of this electricity supply account.

# Registration_Commercial
source: Commercial
ms: MS-Commercial

# Registration_CurrentBill
source: Current bill
ms: MS-Current bill

# Registration_GotIt
source: Got It!
ms: MS-Got It!

# Registration_NickNameEmptyMessage
source: Account nickname cannot be empty. Please enter valid nickname and try adding your account again.
ms: MS-Account nickname cannot be empty. Please enter valid nickname and try adding your account again.

# Registration_NoAccountsFoundMessage
source: Please tap on the button below to add your TNB electricity account.
ms: MS-Please tap on the button below to add your TNB electricity account.

# Registration_NoAccountsTitle
source: No accounts found!
ms: MS-No accounts found!

# Registration_NoRightsAnswer
source: I may not have the rights to view all information related to this electricity supply account. I may only view:
ms: MS-I may not have the rights to view all information related to this electricity supply account. I may only view:

# Registration_OTPMobileUpdate
source: An OTP has been sent to {0}, please enter it below.
ms: MS-An OTP has been sent to {0}, please enter it below.

# Registration_OTPRegistration
source: Please enter the 4-digit activation pin that was sent to {0}.
ms: MS-Please enter the 4-digit activation pin that was sent to {0}.

# Registration_OutstandingPayment
source: Outstanding payment
ms: MS-Outstanding payment

# Registration_PastBills
source: Past bills
ms: MS-Past bills

# Registration_PaymentHistory
source: Payment history
ms: MS-Payment history

# Registration_QuestionICRegistered
source: Was this electricity supply account registered with your IC / ROC / Passport No.?
ms: MS-Was this electricity supply account registered with your IC / ROC / Passport No.?

# Registration_RegisterNote
source: By registering, you are agreeing to the TNB Terms and Conditions, User Agreement and Privacy policy.
ms: MS-By registering, you are agreeing to the TNB Terms and Conditions, User Agreement and Privacy policy.

# Registration_RemoveAccountMessage
source: You are about to remove {0}, account number {1}.
ms: MS-You are about to remove {0}, account number {1}.

# Registration_RemoveAccountTitle
source: Remove Account
ms: MS-Remove Account

# Registration_Resend
source: Resend
ms: MS-Resend

# Registration_ResendTimer
source: Resend ({0})
ms: MS-Resend ({0})

# Registration_Residential
source: Residential
ms: MS-Residential

# Registration_RightsAnswer
source: I have the rights to view all information related to this electricity supply account.
ms: MS-I have the rights to view all information related to this electricity supply account.

# Registration_RightsQuestion
source: Do you have the rights to view all information related to this electricity supply account?
ms: MS-Do you have the rights to view all information related to this electricity supply account?

# Registration_ScanMessage
source: Scan the barcode on your bill to retrieve account details.
ms: MS-Scan the barcode on your bill to retrieve account details.

# Registration_SMSMessage
source: An SMS containing the activation pin has been sent to your number.
ms: MS-An SMS containing the activation pin has been sent to your number.

# Registration_SMSNotReceived
source: Didn’t receive the SMS?
ms: MS-Didn’t receive the SMS?

# Registration_SupplyAccountCount
source: electricity supply account(s) found!
ms: MS-electricity supply account(s) found!

# Registration_TnCTitle
source: Terms & Conditions
ms: MS-Terms & Conditions

# Registration_UsageGraph
source: Usage graph
ms: MS-Usage graph

# Registration_VerifyPinTitle
source: Verify Pin
ms: MS-Verify Pin

# Registration_WhereIsMyAccountNumber
source: Where is my account no.?
ms: MS-Where is my account no.?

# SelectAccount_Title
source: Select Electricity Account
ms: MS-Select Electricity Account

# Tabbar_Bills
source: Bills
ms: MS-Bills

# Tabbar_Dashboard
source: Dashboard
ms: MS-Dashboard

# Tabbar_Feedback
source: Feedback
ms: MS-Feedback

# Tabbar_More
source: More
ms: MS-More

# Tabbar_Promotions
source: Promotions
ms: MS-Promotions

# ViewBill_Advice
source: Advice
ms: MS-Advice

# ViewBill_Title
source: Bill
ms: MS-Bill

# AmountRE
source: My Earnings
ms: MS-My Earnings

# AmountNormalAccount
source: Amount Due
ms: MS-Amount Due

# REPaymentSectionHeader
source: Payment Advice / Payment History
ms: MS-Payment Advice / Payment History

# CurrentAmountRE
source: Current Amount
ms: MS-Current Amount

# OutstandingAmountRE
source: Outstanding Amount
ms: MS-Outstanding Amount

# TotalRE
source: My Earnings
ms: MS-My Earnings

# CurrentAmount
source: Current Charges
ms: MS-Current Charges

# OutstandingAmount
source: Outstanding Charges
ms: MS-Outstanding Charges

# Total
source: Total Amount Due
ms: MS-Total Amount Due

# BillsInfo
source: Bills
ms: MS-Bills

# PaymentAdviceInfo
source: Payment Advice
ms: MS-Payment Advice

# Payment From
source: From TNB
ms: MS-From TNB

# VerifyMobilePrompt
source: For security purpose, please enter your mobile number to verify this device.
ms: MS-For security purpose, please enter your mobile number to verify this device.

# ErrorVerifyDevice
source: Cannot verify device. Please try again.
ms: MS-Cannot verify device. Please try again.

# ErrorMobileNumberUpdate
source: Cannot update mobile number. Please try again.
ms: MS-Cannot update mobile number. Please try again.

# EnterOTPMobileUpdate
source: An OTP has been sent to {0}, please enter it below.
ms: MS-An OTP has been sent to {0}, please enter it below.

# EnterOTPRegistration
source: Please enter the 4-digit activation pin that was sent to {0}.
ms: MS-Please enter the 4-digit activation pin that was sent to {0}.

# NavTitleVerified
source: Update Mobile No.
ms: MS-Update Mobile No.

# NavTitleNotVerified
source: Verify Device
ms: MS-Verify Device

# SaveCCTickBox
source: I want to save this card for future use.
ms: MS-I want to save this card for future use.

# PromotionsTitle
source: Promotions
ms: MS-Promotions

source: Log Out
ms: MS-Log Out

# LogoutConfirmation
source: Are you sure you want to log out from myTNB app?
ms: MS-Are you sure you want to log out from myTNB app?

# LogoutMessage
source: You are now logged out of myTNB app.
ms: MS-You are now logged out of myTNB app.

# VerifyPinTitle
source: Verify Pin
ms: MS-Verify Pin

# AllAccountsHeader
source: All Accounts
ms: MS-All Accounts

# REAccountsSectionHeader
source: Renewable Energy
ms: MS-Renewable Energy

# NormalAccountsSectionHeader
source: Accounts
ms: MS-Accounts

# REAccountsSectionSubHeader
source: My Earnings
ms: MS-My Earnings

# NormalAccountsSectionSubHeader
source: Due
ms: MS-Due

source: Add Another Account
ms: MS-Add Another Account

# GoodMorningGreeting
source: Good Morning
ms: MS-Good Morning

# GoodAfternoonGreeting
source: Good Afternoon
ms: MS-Good Afternoon

# GoodEveningGreeting
source: Good Evening
ms: MS-Good Evening

source: Load More Accounts
ms: MS-Load More Accounts

# PDFNavTitle
source: Payment Receipt
ms: MS-Payment Receipt

# PDFTitle
source: Payment Receipt
ms: MS-Payment Receipt

# PDFSalutation
source: Dear Customer,
ms: MS-Dear Customer,

# PDFMessagePartOne
source: Thank you for using myTNB.
ms: MS-Thank you for using myTNB.

# PDFMessagePartTwo
source: We are pleased to inform you that the following online payment via {0} is Successful:
ms: MS-We are pleased to inform you that the following online payment via {0} is Successful:

# PDFMessageFull
source: Thank you for using myTNB. We are pleased to inform you that the following online payment via {0} is Successful:
ms: MS-Thank you for using myTNB. We are pleased to inform you that the following online payment via {0} is Successful:

# PDFRefNumber
source: REFERENCE NUMBER
ms: MS-REFERENCE NUMBER

# PDFAcctNumber
source: ACCOUNT NUMBER
ms: MS-ACCOUNT NUMBER

# PDFAcctName
source: ACCOUNT HOLDER'S NAME
ms: MS-ACCOUNT HOLDER'S NAME

# PDFAmnt
source: AMOUNT (RM)
ms: MS-AMOUNT (RM)

# PDFTrnxDate
source: TRANSACTION DATE
ms: MS-TRANSACTION DATE

# PDFTrnxId
source: TRANSACTION ID
ms: MS-TRANSACTION ID

# PDFTrnxMethod
source: TRANSACTION METHOD
ms: MS-TRANSACTION METHOD

# PDFTotalAmount
source: Total Amount (RM)
ms: MS-Total Amount (RM)

# PDFNote
source: NOTE: This receipt is computer generated and no signature is required.
ms: MS-NOTE: This receipt is computer generated and no signature is required.

# PDFNoReceipt
source: No Receipt Found
ms: MS-No Receipt Found

# PaymentNavTitleCC
source: Enter OTP
ms: MS-Enter OTP

# PaymentNavTitleFPX
source: Online Banking
ms: MS-Online Banking

# ErrNoNetworkTitle
source: No Internet Connection
ms: MS-No Internet Connection

# ErrNoNetworkMsg
source: Please check your internet connection and try again.
ms: MS-Please check your internet connection and try again.

# PaymentAlertTitle
source: Abort Payment!
ms: MS-Abort Payment!

# PaymentAlertMsg
source: Are you sure you want to abort payment?
ms: MS-Are you sure you want to abort payment?

# AddAcctResNickNameHint
source: e.g. My House, Parent's House
ms: MS-e.g. My House, Parent's House

# AddAcctComNickNameHint
source: e.g. Bangsar Shopping Centre Branch
ms: MS-e.g. Bangsar Shopping Centre Branch

# NewUpdateAction
source: Update Now
ms: MS-Update Now

# NewUpdateTitle
source: New Update Available
ms: MS-New Update Available

# SelectBillInvalidAmount
source: Minimum amount cannot be lower than RM1.00
ms: MS-Minimum amount cannot be lower than RM1.00

# ManageAcctNavTitle
source: Manage Electricity Account
ms: MS-Manage Electricity Account

# ManageAcctRemoveTitle
source: Remove Account
ms: MS-Remove Account

# ManageAcctRemoveOk
source: OK
ms: MS-OK

# ManageAcctRemoveMsg
source: You are about to remove {0}, Account No. {1} from the app. Note: This does not close your electricity supply account. Visit www.mytnb.com.my or Kedai Tenaga to close your electricity supply account.
ms: MS-You are about to remove {0}, Account No. {1} from the app. Note: This does not close your electricity supply account. Visit www.mytnb.com.my or Kedai Tenaga to close your electricity supply account.

# ManageAcctRemoveBtn
source: Remove This Account
ms: MS-Remove This Account

# DshbrdNoAccountMsg
source: Add your existing TNB Electricity Supply Account{0}to view usage and transaction details.
ms: MS-Add your existing TNB Electricity Supply Account{0}to view usage and transaction details.

# GetSmartMeterDataError
source: Unable to fetch smart meter data! Please try later.
ms: MS-Unable to fetch smart meter data! Please try later.

# NotifViewPromoBtn
source: View Promotion
ms: MS-View Promotion

# ResendBtnTimerTxt
source: Resend ({0})
ms: MS-Resend ({0})

# ResendBtnTxt
source: Resend
ms: MS-Resend

# DefaultServerErrorMessage
source: There is an error in the server, please try again.
ms: MS-There is an error in the server, please try again.

# ErrInvalidAcct
source: Please enter a valid 12-digit account no.
ms: MS-Please enter a valid 12-digit account no.

# ErrInvalidAcctMultiLimit
source: Please enter a valid 12-digit or 14-digit account no.
ms: MS-Please enter a valid 12-digit or 14-digit account no.

# RememberMeLbl
source: Remember email
ms: MS-Remember email

# PayBillBtnSngle
source: Pay Bill
ms: MS-Pay Bill

# PayBillBtnMltple
source: Pay Bill ({0})
ms: MS-Pay Bill ({0})

# AddAcct
source: Add Account
ms: MS-Add Account

# BackToDshbrd
source: Back to Dashboard
ms: MS-Back to Dashboard

source: Back to Home
ms: MS-Back to Home

source: Proceed to Login
ms: MS-Proceed to Login

# OTPErrTtle
source: Verify Mobile Number Token Failed
ms: MS-Verify Mobile Number Token Failed

# AcctNicknameInUseError
source: Nickname already used. Please create a new one.
ms: MS-Nickname already used. Please create a new one.

# AcctNicknameInvalidError
source: Invalid account nickname
ms: MS-Invalid account nickname

# AddAcctNicknameInvalidError
source: Invalid characters. Use letters or numbers only.
ms: MS-Invalid characters. Use letters or numbers only.

# OutstandingPymnt
source: Outstanding payment
ms: MS-Outstanding payment

source: Usage graph
ms: MS-Usage graph

# PaymntHstry
source: Payment history
ms: MS-Payment history

source: Current bill
ms: MS-Current bill

source: Past bills
ms: MS-Past bills

# UpdateNicknameError
source: Cannot update nickname. Please try again.
ms: MS-Cannot update nickname. Please try again.

# SubmitFeedbackErrTitle
source: Submit Feedback Failed
ms: MS-Submit Feedback Failed

# ErrorTitle
source: Error
ms: MS-Error

source: Abort
ms: MS-Abort

source: Cancel
ms: MS-Cancel

# AddElectricityAccnt
source: Add Electricity Account
ms: MS-Add Electricity Account

# QuestionICRegistered
source: Was this electricity supply account registered with your IC / ROC / Passport No.?
ms: MS-Was this electricity supply account registered with your IC / ROC / Passport No.?

# AnswerForOwner
source: I'm the owner of this electricity supply account.
ms: MS-I'm the owner of this electricity supply account.

# AnswerForNonOwner
source: I’m renting this place / it belongs to my parents.
ms: MS-I’m renting this place / it belongs to my parents.

source: Yes
ms: MS-Yes

source: No
ms: MS-No

# NoAcctsFoundTitle
source: No accounts found!
ms: MS-No accounts found!

# NoAcctsFoundDesc
source: Please tap on the button below to add your TNB electricity account.
ms: MS-Please tap on the button below to add your TNB electricity account.

# DefaultErrorMessage
source: Sorry, something went wrong. Please try again later.
ms: MS-Sorry, something went wrong. Please try again later.

# SmartMeterMessage
source: Note: Your usage above is before applicable taxes/additional charges.
ms: MS-Note: Your usage above is before applicable taxes/additional charges.

# RefreshBtn
source: Refresh
ms: MS-Refresh
