Repository: myTNB-SONAR/myTNB-Xamarin-android-3.2.7-sit
Catalog: myTNB.iOS/Resources/*.lproj/Localizable.strings
Languages: ms

# Bill_Advice
source: Advice
ms: MS-Advice

# Bill_Bills
source: Bills
ms: MS-Bills

# Bill_By
source: By
ms: MS-By

# Bill_CurrentBill
source: Current Bill
ms: MS-Current Bill

# Bill_CurrentCharges
source: Current Charges
ms: MS-Current Charges

# Bill_CurrentPaymentAdvice
source: Current Payment Advice
ms: MS-Current Payment Advice

# Bill_MyEarnings
source: My Earnings
ms: MS-My Earnings

# Bill_NoBill
source: Yay! No bills! You will be notified when your bill is ready.
ms: MS-Yay! No bills! You will be notified when your bill is ready.

# Bill_NoDataConnection
source: Unable to load. Check your internet connection or try again later.
ms: MS-Unable to load. Check your internet connection or try again later.

# Bill_NoPayment
source: No payments yet! Payments made will be shown here.
ms: MS-No payments yet! Payments made will be shown here.

# Bill_OutstandingCharges
source: Outstanding Charges
ms: MS-Outstanding Charges

# Bill_Pay
source: Pay
ms: MS-Pay

# Bill_PaymentAdviceAmount
source: Payment Advice Amount
ms: MS-Payment Advice Amount

# Bill_PaymentAdviceInfo
source: Payment Advice
ms: MS-Payment Advice

# Bill_PaymentFrom
source: From TNB
ms: MS-From TNB

# Bill_PaymentSectionHeader
source: Bill / Payment History
ms: MS-Bill / Payment History

# Bill_RECurrentAmount
source: Current Amount
ms: MS-Current Amount

# Bill_REOutstandingAmount
source: Outstanding Amount
ms: MS-Outstanding Amount

# Bill_REPaymentSectionHeader
source: Payment Advice / Payment History
ms: MS-Payment Advice / Payment History

# Bill_TotalPayable
source: Total Payable
ms: MS-Total Payable

# Bill_Via
source: via
ms: MS-via

# Common_Abort
source: Abort
ms: MS-Abort

# Common_Account
source: Account
ms: MS-Account

# Common_AccountNickname
source: Account Nickname
ms: MS-Account Nickname

# Common_AccountNo
source: Account No.
ms: MS-Account No.

# Common_AccountNumber
source: Account Number
ms: MS-Account Number

# Common_AccountType
source: Account Type
ms: MS-Account Type

# Common_AddAccount
source: Add Account
ms: MS-Add Account

# Common_AddAnotherAccount
source: Add Another Account
ms: MS-Add Another Account

# Common_AddElectricityAccount
source: Add Electricity Account
ms: MS-Add Electricity Account

# Common_All
source: All
ms: MS-All

# Common_Amount(RM)
source: Amount (RM)
ms: MS-Amount (RM)

# Common_AmountDue
source: Amount Due
ms: MS-Amount Due

# Common_Back
source: Back
ms: MS-Back

# Common_BackToDashboard
source: Back to Dashboard
ms: MS-Back to Dashboard

# Common_Cancel
source: Cancel
ms: MS-Cancel

# Common_CardExpiry
source: Card Expiry
ms: MS-Card Expiry

# Common_CardNumber
source: Card Number
ms: MS-Card Number

# Common_Cards
source: Credit / Debit Cards
ms: MS-Credit / Debit Cards

# Common_Close
source: Close
ms: MS-Close

# Common_Confirm
source: Confirm
ms: MS-Confirm

# Common_ConfirmEmail
source: Confirm Email
ms: MS-Confirm Email

# Common_ConfirmPassword
source: Confirm Password
ms: MS-Confirm Password

# Common_CurrentPassword
source: Current Password
ms: MS-Current Password

# Common_CVV
source: CVV
ms: MS-CVV

# Common_Details
source: Details
ms: MS-Details

# Common_Done
source: Done
ms: MS-Done

# Common_Email
source: Email
ms: MS-Email

# Common_Fullname
source: Fullname
ms: MS-Fullname

# Common_GetAccess
source: Get Access
ms: MS-Get Access

# Common_ICNumber
source: Owner's IC No.
ms: MS-Owner's IC No.

# Common_ICROCPassportNumber
source: IC / ROC / Passport No.
ms: MS-IC / ROC / Passport No.

# Common_MaidenName
source: Owner’s mother's maiden name
ms: MS-Owner’s mother's maiden name

# Common_Manage
source: Manage
ms: MS-Manage

# Common_MobileNumber
source: Mobile No.
ms: MS-Mobile No.

# Common_Month
source: Month
ms: MS-Month

# Common_NA
source: N/A
ms: MS-N/A

# Common_Name
source: Name
ms: MS-Name

# Common_NameOnCard
source: Name on Card
ms: MS-Name on Card

# Common_NewPassword
source: New Password
ms: MS-New Password

# Common_Next
source: Next
ms: MS-Next

# Common_No
source: No
ms: MS-No

# Common_NoAccount
source: No Electricity Account
ms: MS-No Electricity Account

# Common_Ok
source: Ok
ms: MS-Ok

# Common_Password
source: Password
ms: MS-Password

# Common_Pay
source: Pay
ms: MS-Pay

# Common_Payment
source: Payment
ms: MS-Payment

# Common_Refresh
source: Refresh
ms: MS-Refresh

# Common_Register
source: Register
ms: MS-Register

# Common_Retry
source: Retry
ms: MS-Retry

# Common_ROCNo
source: ROC No.
ms: MS-ROC No.

# Common_Save
source: Save
ms: MS-Save

# Common_Skip
source: Skip
ms: MS-Skip

# Common_Submit
source: Submit
ms: MS-Submit

# Common_TotalAmount
source: Total Amount
ms: MS-Total Amount

# Common_TotalAmount(RM)
source: Total Amount (RM)
ms: MS-Total Amount (RM)

# Common_TotalAmountDue
source: Total Amount Due
ms: MS-Total Amount Due

# Common_TryAgain
source: Try Again
ms: MS-Try Again

# Common_Update
source: Update
ms: MS-Update

# Common_Warning
source: Warning
ms: MS-Warning

# Common_Year
source: Year
ms: MS-Year

# Common_Yes
source: Yes
ms: MS-Yes

# Component_AsOf
source: As of
ms: MS-As of

# Component_AverageElectricUsage
source: Avg. electric usage
ms: MS-Avg. electric usage

# Component_CannotLoadChart
source: Sorry, we could not load your usage chart
ms: MS-Sorry, we could not load your usage chart

# Component_CO2
source: CO²
ms: MS-CO²

# Component_CurrentBill
source: Current Bill
ms: MS-Current Bill

# Component_CurrentCharges
source: Current charges
ms: MS-Current charges

# Component_CurrentEmission
source: Current emission
ms: MS-Current emission

# Component_CurrentUsage
source: Current usage
ms: MS-Current usage

# Component_EstimatedReading
source: *Estimated Reading
ms: MS-*Estimated Reading

# Component_ForCurrentMonth
source: For current month
ms: MS-For current month

# Component_GetAccessMessage
source: Only electricity account owners may view usage and transaction details.
ms: MS-Only electricity account owners may view usage and transaction details.

# Component_GreetingAfternoon
source: Good Afternoon
ms: MS-Good Afternoon

# Component_GreetingEvening
source: Good Evening
ms: MS-Good Evening

# Component_GreetingMorning
source: Good Morning
ms: MS-Good Morning

# Component_NoAccountMessage
source: Add your existing TNB Electricity Supply Account{0}to view usage and transaction details.
ms: MS-Add your existing TNB Electricity Supply Account{0}to view usage and transaction details.

# Component_ProjectedCost
source: Projected cost
ms: MS-Projected cost

# Component_SeeSmartMeter
source: You’ll see your usage here soon.
ms: MS-You’ll see your usage here soon.

# Component_SmartMeterMessage
source: Note: Your usage above is before applicable taxes/additional charges.
ms: MS-Note: Your usage above is before applicable taxes/additional charges.

# Component_TapToRefresh
source: Tap to refresh
ms: MS-Tap to refresh

# Component_Usage
source: Usage
ms: MS-Usage

# Component_ViewPaymentAdvice
source: View Payment Advice
ms: MS-View Payment Advice

# Component_ViewUsageHistory
source: View usage history
ms: MS-View usage history

# Component_VsLastMonth
source: Vs. last month
ms: MS-Vs. last month

# Component_WelcomeToSmartMeter
source: Welcome to your Smart Meter Dashboard.
ms: MS-Welcome to your Smart Meter Dashboard.

# Dashboard_AllAccounts
source: All Accounts
ms: MS-All Accounts

# Dashboard_DateRangeAvailableSoon
source: Available Soon
ms: MS-Available Soon

# Dashboard_LoadMoreAccounts
source: Load More Accounts
ms: MS-Load More Accounts

# Dashboard_RESectionHeader
source: Renewable Energy
ms: MS-Renewable Energy

# Dashboard_RESectionSubHeader
source: My Earnings
ms: MS-My Earnings

# Dashboard_SectionHeader
source: Accounts
ms: MS-Accounts

# Error_BCRMMessage
source: BRCM will be down for maintenance purpose
ms: MS-BRCM will be down for maintenance purpose

# Error_CheckInternetMessage
source: Please check your Internet connection.
ms: MS-Please check your Internet connection.

# Error_DefaultMessage
source: Sorry, something went wrong. Please try again later.
ms: MS-Sorry, something went wrong. Please try again later.

# Error_DefaultTitle
source: Error
ms: MS-Error

# Error_DuplicateAccountMessage
source: This account number is already added on the list
ms: MS-This account number is already added on the list

# Error_DuplicateAccountTitle
source: Duplicate Account
ms: MS-Duplicate Account

# Error_EmailRequired
source: Email field is required.
ms: MS-Email field is required.

# Error_EmptyCardNumberMessage
source: Please enter valid card number and try again.
ms: MS-Please enter valid card number and try again.

# Error_EmptyCardNumberTitle
source: Empty Card Number
ms: MS-Empty Card Number

# Error_FeedbackTitle
source: Submit Feedback Failed
ms: MS-Submit Feedback Failed

# Error_GetSmartMeterDataMessage
source: Unable to fetch smart meter data! Please try later.
ms: MS-Unable to fetch smart meter data! Please try later.

# Error_LinkNotAvailable
source: Links are not available right now. Please try again later.
ms: MS-Links are not available right now. Please try again later.

# Error_Login
source: Login Error
ms: MS-Login Error

# Error_MismatchedEmail
source: Your email and confirmation email do not match.
ms: MS-Your email and confirmation email do not match.

# Error_MismatchedPassword
source: Your password and confirmation password do not match.
ms: MS-Your password and confirmation password do not match.

# Error_MobileNumberUpdate
source: Cannot update mobile number. Please try again.
ms: MS-Cannot update mobile number. Please try again.

# Error_NoNetworkMsg
source: Please check your internet connection and try again.
ms: MS-Please check your internet connection and try again.

# Error_NoNetworkTitle
source: No Internet Connection
ms: MS-No Internet Connection

# Error_OTPTitle
source: Verify Mobile Number Token Failed
ms: MS-Verify Mobile Number Token Failed

# Error_PasswordRequired
source: Password field is required.
ms: MS-Password field is required.

# Error_RatingNotAvailable
source: Rating is not available right now. Please try again later.
ms: MS-Rating is not available right now. Please try again later.

# Error_Registration
source: Registration Error
ms: MS-Registration Error

# Error_RegistraionTokenTitle
source: Registration Token Failed
ms: MS-Registration Token Failed

# Error_ShareNotAvailable
source: Sharing is not available right now. Please try again later.
ms: MS-Sharing is not available right now. Please try again later.

# Error_TelephoneNumberNotAvailable
source: Number is not available right now. Please try again later.
ms: MS-Number is not available right now. Please try again later.

# Error_TimeOut
source: We can't get your account details at the moment. Please refresh this page.
ms: MS-We can't get your account details at the moment. Please refresh this page.

# Error_UpdateNickname
source: Cannot update nickname. Please try again.
ms: MS-Cannot update nickname. Please try again.

# Error_VerifyDevice
source: Cannot verify device. Please try again.
ms: MS-Cannot verify device. Please try again.

# Feedback_AccessMessage
source: Turn On Location Services to allow "myTNB" to determine your location
ms: MS-Turn On Location Services to allow "myTNB" to determine your location

# Feedback_AccessTitle
source: Location Access is not allowed
ms: MS-Location Access is not allowed

# Feedback_AttachPhotoMessage
source: ATTACH PHOTO / SCREENSHOT (OPTIONAL)
ms: MS-ATTACH PHOTO / SCREENSHOT (OPTIONAL)

# Feedback_BackToFeedback
source: Back to Feedback
ms: MS-Back to Feedback

# Feedback_BillSubTitle
source: Lodge your bill and account issues here.
ms: MS-Lodge your bill and account issues here.

# Feedback_Camera
source: Camera
ms: MS-Camera

# Feedback_CameraRoll
source: Camera Roll
ms: MS-Camera Roll

# Feedback_CharacterLeft
source: {0} character left
ms: MS-{0} character left

# Feedback_CharactersLeft
source: {0} characters left
ms: MS-{0} characters left

# Feedback_DateTimeTitle
source: Feedback Date & Time
ms: MS-Feedback Date & Time

# Feedback_FaultyLampMessage
source: You may only report faulty TNB street lamps. Look out for TNB’s blue and red or the logo as shown above. Use the pole no. (e.g. 17493 8E 1) to specify the lamp.
ms: MS-You may only report faulty TNB street lamps. Look out for TNB’s blue and red or the logo as shown above. Use the pole no. (e.g. 17493 8E 1) to specify the lamp.

# Feedback_FaultyLampTitle
source: Reporting faulty street lamps?
ms: MS-Reporting faulty street lamps?

source: Feedback ID
ms: MS-Feedback ID

# Feedback_Location
source: Location / Street Name
ms: MS-Location / Street Name

# Feedback_MaxFiles
source: Max 2 files
ms: MS-Max 2 files

# Feedback_NoFeedbackSubmittedMessage
source: You have not submittted any feedback.
ms: MS-You have not submittted any feedback.

# Feedback_OthersSubtitle
source: Suggestions, complaints, and other inquiries
ms: MS-Suggestions, complaints, and other inquiries

# Feedback_Photo
source: Photo / Screenshot
ms: MS-Photo / Screenshot

# Feedback_PoleNumber
source: Pole No.
ms: MS-Pole No.

# Feedback_GoToSettings
source: Go to Settings
ms: MS-Go to Settings

# Feedback_SelectAccountNumber
source: Select Account No.
ms: MS-Select Account No.

# Feedback_State
source: State
ms: MS-State

source: Feedback Status
ms: MS-Feedback Status

# Feedback_StreetLampSubTitle
source: Spot a faulty street lamp? Report it here.
ms: MS-Spot a faulty street lamp? Report it here.

# Feedback_SubmittedFeedbackSubTitle
source: View status updates on your feedback here.
ms: MS-View status updates on your feedback here.

# Feedback_SubmittedFeedbackTitle
source: Submitted Feedback
ms: MS-Submitted Feedback

source: Feedback Successful
ms: MS-Feedback Successful

# Feedback_SuccessfulMessage
source: Thank you for your feedback.
ms: MS-Thank you for your feedback.

# Feedback_Title
source: Feedback
ms: MS-Feedback

source: Feedback Type
ms: MS-Feedback Type

source: Feedback Unsuccessful
ms: MS-Feedback Unsuccessful

# Feedback_UnsuccessfulMessage
source: Your feedback didn't go through.
ms: MS-Your feedback didn't go through.

# FindUs_Address
source: Address
ms: MS-Address

# FindUs_FindUs
source: Find Us
ms: MS-Find Us

# FindUs_No711Found
source: No 7-Eleven Found
ms: MS-No 7-Eleven Found

# FindUs_NoKTFound
source: No Kedai Tenaga Found
ms: MS-No Kedai Tenaga Found

# FindUs_MapSelection
source: Map Selection
ms: MS-Map Selection

# FindUs_NoSupportedApplication
source: No supported map application is installed.
ms: MS-No supported map application is installed.

# FindUs_Open24Hours
source: Open 24 Hours
ms: MS-Open 24 Hours

# FindUs_OpenIn
source: Open in
ms: MS-Open in

# FindUs_OpeningHours
source: OPENING HOURS
ms: MS-OPENING HOURS

# FindUs_Phone
source: Phone
ms: MS-Phone

# FindUs_Search
source: Search Kedai Tenaga by road name, area
ms: MS-Search Kedai Tenaga by road name, area

# FindUs_SelectApplication
source: Select navigation application.
ms: MS-Select navigation application.

# FindUs_Services
source: Services
ms: MS-Services

# FindUs_ServicesDescription
source: • Payment of electricity bills and other utility bills
ms: MS-• Payment of electricity bills and other utility bills

# FindUs_Show
source: Show
ms: MS-Show

# FindUs_ZeroLocations
source: 0 Locations
ms: MS-0 Locations

# GetAccess_RequestedToOwnerMessage
source: Access Requested to the Owner
ms: MS-Access Requested to the Owner

# Hint_BusinessNickname
source: e.g. Bangsar Shopping Centre Branch
ms: MS-e.g. Bangsar Shopping Centre Branch

# Hint_CardExpiry
source: Card Expiry (MM/YY)
ms: MS-Card Expiry (MM/YY)

# Hint_MobileNumber
source: Please include the country code of your phone number.
ms: MS-Please include the country code of your phone number.

# Hint_MobileNumberExample
source: Example: +6012 345 6789
ms: MS-Example: +6012 345 6789

# Hint_Nickname
source: e.g. My House, Parent's House
ms: MS-e.g. My House, Parent's House

# Hint_Password
source: Password must have at least 8 alphanumeric characters.
ms: MS-Password must have at least 8 alphanumeric characters.

# Invalid_AccountLength
source: Please enter a valid 12-digit or 14-digit account number
ms: MS-Please enter a valid 12-digit or 14-digit account number

source: Invalid account nickname
ms: MS-Invalid account nickname

# Invalid_AccountNicknameInUse
source: Nickname already used. Please create a new one.
ms: MS-Nickname already used. Please create a new one.

source: Invalid Account Type
ms: MS-Invalid Account Type

# Invalid_AmountMessage
source: Kindly enter a non-zero/positive amount
ms: MS-Kindly enter a non-zero/positive amount

# Invalid_AmountTitle
source: Invalid Amount
ms: MS-Invalid Amount

source: Invalid barcode.
ms: MS-Invalid barcode.

# Invalid_CardExpiry
source: Invalid card expiration date
ms: MS-Invalid card expiration date

source: Invalid Card Number
ms: MS-Invalid Card Number

# Invalid_Characters
source: Invalid characters. Use letters or numbers only.
ms: MS-Invalid characters. Use letters or numbers only.

source: Invalid code
ms: MS-Invalid code

source: Invalid CVV
ms: MS-Invalid CVV

# Invalid_Email
source: Invalid email address
ms: MS-Invalid email address

source: Invalid feedback
ms: MS-Invalid feedback

source: Invalid feedback type
ms: MS-Invalid feedback type

source: Invalid full name
ms: MS-Invalid full name

# Invalid_ICNo
source: Invalid IC number
ms: MS-Invalid IC number

# Invalid_ICROCPassportNumber
source: Invalid IC, ROC or Passport No.
ms: MS-Invalid IC, ROC or Passport No.

# Invalid_Location
source: Invalid location / Street name
ms: MS-Invalid location / Street name

source: Invalid maiden name
ms: MS-Invalid maiden name

source: Invalid mobile number
ms: MS-Invalid mobile number

# Invalid_NameOnCard
source: Invalid Name
ms: MS-Invalid Name

# Invalid_NicknameEntry
source: Account nickname cannot be empty. Please enter valid nickname and try adding your account again.
ms: MS-Account nickname cannot be empty. Please enter valid nickname and try adding your account again.

source: Invalid Old Password
ms: MS-Invalid Old Password

# Invalid_Password
source: Password must have at least 8 alphanumeric characters.
ms: MS-Password must have at least 8 alphanumeric characters.

# Invalid_PayAmount
source: Minimum amount cannot be lower than RM1.00
ms: MS-Minimum amount cannot be lower than RM1.00

source: Invalid PIN
ms: MS-Invalid PIN

source: Invalid pole number
ms: MS-Invalid pole number

source: Invalid ROC No.
ms: MS-Invalid ROC No.

source: Invalid state
ms: MS-Invalid state

# Language_English
source: English
ms: MS-English

# Language_Malay
source: Bahasa Melayu
ms: MS-Bahasa Melayu

# Language_Title
source: Language
ms: MS-Language

# Login_AccountLogin
source: myTNB Account Login
ms: MS-myTNB Account Login

# Login_CallUs
source: Call Us
ms: MS-Call Us

# Login_ChangePasswordNote
source: This new password will replace your current one. All account details remain unchanged.
ms: MS-This new password will replace your current one. All account details remain unchanged.

# Login_CodeSentToEmailMessage
source: A 4-digit verification code will be sent to this email address.
ms: MS-A 4-digit verification code will be sent to this email address.

# Login_CodeSentToMessage
source: Please enter the 4-digit code that was sent to {0}
ms: MS-Please enter the 4-digit code that was sent to {0}

# Login_ConfirmNewPassword
source: Confirm new password
ms: MS-Confirm new password

# Login_EmailNotReceived
source: Didn’t receive the email?
ms: MS-Didn’t receive the email?

# Login_EnterCode
source: Enter Code
ms: MS-Enter Code

# Login_EnterEmail
source: Please enter your email.
ms: MS-Please enter your email.

# Login_EnterNewPassword
source: Enter new password
ms: MS-Enter new password

# Login_EnterPassword
source: Please enter your new password.
ms: MS-Please enter your new password.

# Login_Feedback
source: Feedback
ms: MS-Feedback

# Login_FindUs
source: Find Us
ms: MS-Find Us

# Login_ForgotPassword
source: Forgot password?
ms: MS-Forgot password?

# Login_Login
source: Login
ms: MS-Login

# Login_ManageYourAccount
source: Manage your account now!
ms: MS-Manage your account now!

# Login_Note
source: Log in to enjoy more features!
ms: MS-Log in to enjoy more features!

# Login_NoTNBAccount
source: Don't have a myTNB account?
ms: MS-Don't have a myTNB account?

# Login_PasswordResetSuccess
source: Password Reset Successful
ms: MS-Password Reset Successful

# Login_PinSentMessage
source: An email containing the activation pin has been sent to your email Address.
ms: MS-An email containing the activation pin has been sent to your email Address.

# Login_ProceedToLogin
source: Your password has been changed successfully. You may proceed to login with the new password.
ms: MS-Your password has been changed successfully. You may proceed to login with the new password.

# Login_ProceedToLoginTitle
source: Proceed to Login
ms: MS-Proceed to Login

# Login_Promotions
source: Promotions
ms: MS-Promotions

# Login_QuickAccess
source: Quick Access
ms: MS-Quick Access

# Login_RememberMe
source: Remember email
ms: MS-Remember email

# Login_RegisterForAccount
source: Register for an account
ms: MS-Register for an account

# Login_Resend
source: Resend
ms: MS-Resend

# Login_ResendTimer
source: Resend ({0})
ms: MS-Resend ({0})

# Login_ResetPasswordTitle
source: Reset Password
ms: MS-Reset Password

# Login_TemporaryPasswordLoginMessage
source: Log in using the 8-digit temporary password that was sent to {0}. You may change your password after logging in.
ms: MS-Log in using the 8-digit temporary password that was sent to {0}. You may change your password after logging in.

# Login_Welcome
source: Welcome
ms: MS-Welcome

# Logout_BackToHome
source: Back to Home
ms: MS-Back to Home

# Logout_Message
source: You are now logged out of myTNB app.
ms: MS-You are now logged out of myTNB app.

# Logout_ThankYouMessage
source: Thank you for using myTNB.
ms: MS-Thank you for using myTNB.

# Manage_ManageElectricityAccount
source: Manage Electricity Account
ms: MS-Manage Electricity Account

# Manage_RemoveAccount
source: Remove This Account
ms: MS-Remove This Account

# Manage_RemoveAccountMessage
source: You are about to remove {0}, Account No. {1} from the app. Note: This does not close your electricity supply account. Visit www.mytnb.com.my or Kedai Tenaga to close your electricity supply account.
ms: MS-You are about to remove {0}, Account No. {1} from the app. Note: This does not close your electricity supply account. Visit www.mytnb.com.my or Kedai Tenaga to close your electricity supply account.

# Manage_UpdateNicknameSuccess
source: Account nickname has been updated successfully.
ms: MS-Account nickname has been updated successfully.

# Manage_UpdateNicknameTitle
source: Update Account Nickname
ms: MS-Update Account Nickname

# Manage_AddCardMessage
source: You may only add a new credit / debit card when making payment.
ms: MS-You may only add a new credit / debit card when making payment.

# Manage_CardsDebitTitle
source: Manage Credit / Debit Cards
ms: MS-Manage Credit / Debit Cards

# Manage_CardNotRemovedMessage
source: Credit / Debit Card ending with {0} was not removed. Please try again.
ms: MS-Credit / Debit Card ending with {0} was not removed. Please try again.

# Manage_CardRemovedSuccessMessage
source: Credit / debit card ending with {0} has been removed successfully.
ms: MS-Credit / debit card ending with {0} has been removed successfully.

# Manage_NoSavedCards
source: No credit/debit cards stored. You may only add a credit/debit card during payment.
ms: MS-No credit/debit cards stored. You may only add a credit/debit card during payment.

# Manage_RemoveCardMessage
source: You are about to remove credit / debit card ending with {0}.
ms: MS-You are about to remove credit / debit card ending with {0}.
