Repository: myTNB-SONAR/myTNB-Xamarin-android-3.2.7-sit
Catalog: myTNB.iOS/Resources/*.lproj/Localizable.strings
Languages: ms

# TimeOutMsg
source: We can't get your account details at the moment. Please refresh this page.
ms: MS-We can't get your account details at the moment. Please refresh this page.
