{
  "title": "MS-myTNB FAQ",
  "data": [
    {
      "title": "What is myTNB mobile app?",
      "details": "myTNB mobile app is a digital service to manage your TNB electricity account. View and pay your electricity bills anytime, anywhere, and manage your TNB account on the go!"
    },
    {
      "title": "What's new on this app?",
      "details": "New features include a personalized, interactive Dashboard with a detailed view of your usage for the past 6 months, multiple account views, faster in-app payment with the option to save your credit cards, and a stress-free way to submit feedback."
    },
    {
      "title": "How can I contact TNB?",
      "details": "Getting in touch has never been easier. Call us on 15454 for Outages & Breakdowns and 1-300-88-5454 for Billing & General enquiries about your account. You can also drop us an email at tnbcareline@tnb.com.my or message us on Facebook at <a href=\"http://www.facebook.com/TNBCareline\">http://www.facebook.com/TNBCareline</a>. Alternatively, navigate to ‘Feedback’ on the navigation bar to send an enquiry to our team."
    },
    {
      "title": "Is my personal data safe?",
      "details": "Absolutely. Your privacy is of utmost importance to us, therefore we employ the latest internet security technology to ensure the safety and confidentiality of your data."
    },
    {
      "title": "I have an existing myTNB account, can I use the same account?",
      "details": "Yes, you certainly can! myTNB mobile app and myTNB Portal uses the same set of credentials (user ID and password)."
    },
    {
      "title": "Where can I find my bill account number?",
      "details": "Your 12–digit account number can be found on the top left corner of your monthly paper bill. Alternatively, you can find it by tapping into ‘More’ tab in ‘My Account’, under TNB Electricity Supply Account list. If you are a customer with multiple linked accounts in your myTNB app, your 12–digit account number is displayed in the summary dashboard under account nickname."
    },
    {
      "title": "I have added my account in SSP. However, I cannot see my account on myTNB mobile app. How do I resolve this?",
      "details": "If your account is added in SSP simultaneously when you are logged in on myTNB mobile app, please kindly logout of the mobile app and login again to retry."
    },
    {
      "title": "Can I see multiple accounts in myTNB app and myTNB portal?",
      "details": "Yes, both myTNB app and myTNB portal share the same login information. The account and billing information is real time."
    },
    {
      "title": "Why do I have to update the app upon launch?",
      "details": "We are always improving the app to get you the best experience possible when using our service. We would like you to always be informed when a new version of the app is available with the latest updates."
    },
    {
      "title": "Why do I have to verify my phone number?",
      "details": "Phone number verification is a security feature for us to verify that you are the account holder using the app and conducting transactions."
    },
    {
      "title": "Can I view my usage history beyond 6 months?",
      "details": "You will be able to view your usage history up to 6 months. Similarly on myTNB Portal at <a href=\"https://www.mytnb.com.my\">www.mytnb.com.my</a> you can retrieve information of your TNB electricity account, including usage and billing history of up to 6 months."
    },
    {
      "title": "I am a tenant, how can I view more usage and account details?",
      "details": "As a tenant, you are able to view your usage details for the previous 6 months and the latest electricity bill in the ‘Dashboard’ and ‘Bills’ tab."
    },
    {
      "title": "I am a landlord and would like my tenants to manage their electricity bills with ease.",
      "details": "That’s great! Your tenants are welcome to download and use myTNB mobile app, but for them to enjoy full usage and functionalities of the app, they would need to add the TNB electricity account as owners. You can help them out by providing the IC number registered to the TNB electricity account."
    },
    {
      "title": "Can I add multiple TNB electricity accounts?",
      "details": "Yes. You can add multiple accounts through the add account function. On your graph dashboard, tap on the dropdown button above the usage graph to access the add account function, or tap ‘Add Another Account’ button on the summary dashboard. Similarly, you can go to ‘My Account’ under ‘More’ section in navigation menu."
    },
    {
      "title": "I have multiple electricity accounts. How do I view all my accounts?",
      "details": "You can view all your linked accounts in the summary dashboard. The summary dashboard is a new feature that lets you see a concise preview of all your linked accounts added to your myTNB app."
    },
    {
      "title": "How current is the account information?",
      "details": "Account information is up to date to the current day."
    },
    {
      "title": "How does the summary dashboard work?",
      "details": "The summary dashboard displays primary information such as your account nickname, account number and the balance due and/or your earnings. The accounts are grouped into Renewable Energy and regular meter sections. To see full account usage and details, please tap into each accounts. Tap the “Dashboard” tab in the bottom navigation or the back button on the graph dashboard to access the summary dashboard."
    },
    {
      "title": "Why is my summary dashboard information unavailable?",
      "details": "The summary dashboard information may be unavailable due to several reasons, including:<br><br>– Your internet connection may be down<br>– Your myTNB app has not been updated<br>– Planned server downtime<br><br>In these cases you will see an in-app notice during the downtime period."
    },
    {
      "title": "I don’t see one of my accounts listed on the summary dashboard.",
      "details": "You can scroll down to the bottom of the screen and tap “Load More” to see more linked accounts. Alternatively, you can tap “Add Another Account” to add a new account. The newly added account will be displayed on the list in the summary dashboard and usage details will automatically reflect in the graph dashboard and “Bills” tab."
    },
    {
      "title": "What does RM0.00 amount and (--) symbol mean in the amount ‘Due/My Earnings’ column?",
      "details": "This occurs when you have completed your bill payment for the current bill month and the next month bill has not been generated. For Renewable Energy accounts, this will occur when you have received your payment from TNB for the current month and the next month payment advice has not been generated."
    },
    {
      "title": "What does the negative (–) amount mean in the amount ‘Due’ column for regular customer accounts?",
      "details": "The negative amount occurs in the case where you have completed an over-payment for your regular customer account. The excess amount is reflected on the dashboard."
    },
    {
      "title": "What is kilowatt hour (kWh)?",
      "details": "Kilowatt hour is a measure of how much energy you are using."
    },
    {
      "title": "How can I identify my Smart Meter account?",
      "details": "You can identify your Smart Meter account by looking at your graph dashboard. If you are a Smart Meter account user, you will be able to see your daily usage in the ‘Month’ view in addition to your monthly usage in the ‘Year’ view. You can also see your consumption data underneath your usage graph."
    },
    {
      "title": "How do I add my Smart Meter account?",
      "details": "You can add your Smart Meter account through the add account function. Tap ‘Add Another Account’ button on the summary dashboard or use the dropdown menu on top of your graph dashboard and tap on the ‘Add Another Account’ button. Alternatively, you can manage your accounts in the ‘More’ section."
    },
    {
      "title": "I am renting a place with a Smart Meter, am I able to view usage history on the app?",
      "details": "Yes. As a tenant, you will be able to view your usage history for up to 6 months."
    },
    {
      "title": "What are current charges?",
      "details": "Current charges are your current electricity costs to date for that month."
    },
    {
      "title": "What is projected cost and how is it calculated?",
      "details": "Your projected cost is an estimate of your bill amount for that month. It is calculated based on your energy consumption pattern from the current month."
    },
    {
      "title": "What is current usage?",
      "details": "Your current usage is your current electricity consumption for that month in kilowatt hour (kWh)."
    },
    {
      "title": "What is average electric usage versus last month and how is it calculated?",
      "details": "Your average electric usage is calculated as an increase or decrease in energy consumption, compared to your previous month’s consumption."
    },
    {
      "title": "Can I view my hourly usage in a day?",
      "details": "This feature will be rolled out soon. Keep an eye out for this!"
    },
    {
      "title": "How do I switch between cost (RM) and usage (kWh) view?",
      "details": "You can tap on the ‘RM’ and ‘Usage’ buttons below the graph, at the bottom of the screen. Swipe up to expand your screen."
    },
    {
      "title": "How can I view the last 30 days usage?",
      "details": "You can tap the arrows beside the date range label on top of the graph. Make sure you are on the Month view first."
    },
    {
      "title": "How can I identify my Renewable Energy account?",
      "details": "You can identify your Renewable Energy account by looking at the round green leaf icon on your summary dashboard, graph dashboard, ‘Bills’ tab as well as the account list in your ‘My Account’ settings."
    },
    {
      "title": "How do I add my Renewable Energy account?",
      "details": "You can add your RE account through the add account function. Tap ‘Add Another Account’ button on the summary dashboard or use the dropdown menu on top of your graph dashboard and tap on the ‘Add Another Account’ button. Alternatively, you can manage your accounts in the ‘More’ section. After add account, RE accounts can be identified by looking at the round green leaf icon."
    },
    {
      "title": "How do I view my Renewable Energy (RE) account usage?",
      "details": "On the graph dashboard, you can view your RE account usage by tapping on the bar graph where usage information such as cost (RM) and usage (kWh) will be displayed. Tap on each bar to see the information for 6 previous months."
    },
    {
      "title": "What does ‘My Earnings’ mean and what is the ‘Due by’ date underneath it?",
      "details": "It is the amount you will get paid from TNB. The ‘Due by’ date is the latest date you can expect to get payment from TNB."
    },
    {
      "title": "How do I know when I can expect to get payment from TNB?",
      "details": "You can expect to get payment from TNB up to 30 calendar days from your last payment advice date. The due date is calculated 30 days after your current month’s payment advice date."
    },
    {
      "title": "Where can I view my Renewable Energy (RE) account payment status?",
      "details": "You can view your RE payment status in the ‘Bills’ section by clicking the ‘Payment’ tab."
    },
    {
      "title": "Where can I view all my previous payment advices?",
      "details": "You can view your previous payment advices up to 6 months in the ‘Bills’ tab, under Payment Advice history."
    },
    {
      "title": "How do I check my electricity bill in myTNB mobile app?",
      "details": "You can check your bill by tapping on ‘Current Bill’ on your Dashboard. The latest bill will display in PDF form. Alternatively, go to the ‘Bills’ tab on the navigation bar to view your bill and payment history."
    },
    {
      "title": "How do I pay my bills through myTNB mobile app?",
      "details": "Paying bills through myTNB mobile app is quick and easy. Simply tap on the ‘Pay’ button on your Dashboard and make a payment either with your credit card or through Online Banking via FPX (bank transfer)."
    },
    {
      "title": "I would like to pay for my family’s electricity bills through the app. How do I do this?",
      "details": "You can add your family members’ TNB accounts and manage them through the app. On your Dashboard, tap on the dropdown button above the usage graph to access the add account function, or go to ‘My Account’ under ‘More’ on the navigation bar. Keep in mind that you will need the IC number registered to the TNB account in order to view full usage details."
    },
    {
      "title": "Can I store my credit card info in the app?",
      "details": "Yes, you may choose to save your credit card details on the app for faster payment next time."
    },
    {
      "title": "Can I pay more than my outstanding amount?",
      "details": "Yes. The excess amount will be reflected in your next bill."
    },
    {
      "title": "What is the maximum amount I can pay in one transaction on the app?",
      "details": "You may pay up to RM5,000 in a single transaction via credit/debit card. You may also pay via FXP (bank transfer) if the transaction is more than RM5000."
    },
    {
      "title": "The pay button is disabled. Why can’t I pay my bills?",
      "details": "This may happen due to any planned downtime period. Kindly try again at a later time. Alternatively, you can find other payment methods below:<br><br>myTNB Self Service Portal<br>Pusat Khidmat Pelanggan<br>JomPay<br>One Stop<br>Center Autopay<br>Direct Debit<br>Automated Teller<br>Machine (ATM)<br>Cash Deposit<br>Machine Over<br>the Counter<br>Websites/Internet Payment<br>Phone Banking<br>Cheque Via<br>Post Payquick<br>Kiosks"
    },
    {
      "title": "Where can I view my receipt after my bill payment?",
      "details": "You can find your receipt in the ‘Bills’ section. Click on Payment history tab to view your PDF receipt. Alternatively, you will also be sent a confirmation receipt via the email address registered under your TNB account."
    },
    {
      "title": "What account details can I view in my payment receipt?",
      "details": "You can view account details such as your reference number, account number and account holder’s name, total amount paid, as well as transaction date, ID and transaction method."
    },
    {
      "title": "How can I rate my payment experience?",
      "details": "You can rate your payment experience after completing your payment transaction."
    },
    {
      "title": "Can I view my feedback status in the app?",
      "details": "You may view your feedback status in the “Submitted Feedback” page. The submitted feedback can be found under the ‘Feedback’ tab on the navigation bar."
    },
    {
      "title": "I am unable to receive notifications from myTNB mobile app although I have enabled and selected preferences. What can I do?",
      "details": "Please kindly logout of the mobile app and login again to retry."
    },
    {
      "title": "How can I be informed when there is any app maintenance update, announcement and/or promotion?",
      "details": "You will get push notifications for any general app maintenance updates or other types of on-demand announcements and promotions."
    },
    {
      "title": "Where can I view promotions on the app?",
      "details": "You can view all active promotions in the ‘Promotions’ section. You will be notified of new promotions."
    },
    {
      "title": "How do I view more details on the promotions I am shown when the app launches?",
      "details": "You can view more details by tapping on the ‘Details’ button on the promotion window."
    },
    {
      "title": "Can I skip the promotions I am shown when the app launches?",
      "details": "To close the promotions, simply tap on ‘Skip’ or the ‘X’ button on the promotion window."
    },
    {
      "title": "How do I know when there is any planned downtime or temporary usage disruption in myTNB app?",
      "details": "You will see an in-app notice for any myTNB app planned downtime in your dashboard."
    },
    {
      "title": "I love this app! Managing my TNB account has never been easier. How can I thank you?",
      "details": "Thank you! You can share myTNB mobile app with your friends and family, and rate us on the Apple App Store or Google Play Store."
    }
  ]
}